STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_stpmic2l.c
/**
  ******************************************************************************
  * @file    stm32mp215f_disco_stpmic2l.c
  * @author  MCD Application Team
  * @brief   stpmu driver functions used for ST internal validation
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ----------------------------------------------------------------------*/
#include "stm32mp215f_disco.h" /* TODO */
#include "stm32mp215f_disco_bus.h" /* TODO */
#include "stm32mp215f_disco_stpmic2l.h"
#include <string.h>
#include <stdio.h>

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32MP215F_DISCO
  * @{
  */

/** @addtogroup STPMIC2L
  * @{
  */


/** @defgroup STPMIC_Private_Constants Private Constants
  * @{
  */
/* Driver for PMIC ---------------------------------------------------------------*/

/* Board Configuration ------------------------------------------------------------*/
/**
  * @}
  */

/** @defgroup STPMIC_Private_Defines Private Defines
  * @{
 */
/* Private typedef -----------------------------------------------------------*/


/* Private define ------------------------------------------------------------*/
#define ARRAY_SIZE(x) (sizeof(x) / sizeof((x)[0]))


/**
  * @}
 */

/** @defgroup STPMIC_Private_Variables Private Variables
  * @{
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* I2C handler declaration */
I2C_HandleTypeDef I2cHandle;
extern I2C_HandleTypeDef hI2c3;

static STPMIC2L_Drv_t *Stpmic2lDrv = NULL;
static void         *CompObj = NULL;


/*
  Table of EVAL board regulators
*/

board_regul_struct_t board_regulators_table[] =
{
  {
    "VDDCORE",      VDDCORE,     STPMIC_BUCK1,  BUCK1_MAIN_CR1,  BUCK1_MAIN_CR2,  \
    BUCK1_ALT_CR1,  BUCK1_ALT_CR2,  BUCK1_PWRCTRL_CR,  820,  820
  },
  {
    "VDD2_DDR",     VDD2_DDR,    STPMIC_BUCK2,  BUCK2_MAIN_CR1,  BUCK2_MAIN_CR2,  \
    BUCK2_ALT_CR1,  BUCK2_ALT_CR2,  BUCK2_PWRCTRL_CR, 1100, 1100
  },
  {
    "VDDCPU",       VDDCPU,     STPMIC_BUCK3,  BUCK3_MAIN_CR1,  BUCK3_MAIN_CR2,  \
    BUCK3_ALT_CR1,  BUCK3_ALT_CR2,  BUCK3_PWRCTRL_CR,  800,  910
  },
  {
    "VDDA1V8_AON",  VDDA1V8_AON,  STPMIC_LDO1,   LDO1_MAIN_CR,    LDO1_MAIN_CR,    \
    LDO1_ALT_CR,    LDO1_ALT_CR,    LDO1_PWRCTRL_CR,  1800, 1800
  },
  {
    "VDDIO",        VDDIO,  STPMIC_LDO2,   LDO2_MAIN_CR,    LDO2_MAIN_CR,    \
    LDO2_ALT_CR,    LDO2_ALT_CR,    LDO2_PWRCTRL_CR,  3300, 3300
  },
  {
    "VDD1_DDR",     VDD1_DDR,     STPMIC_LDO3,   LDO3_MAIN_CR,    LDO3_MAIN_CR,    \
    LDO3_ALT_CR,    LDO3_ALT_CR,    LDO3_PWRCTRL_CR,  1800, 1800
  },
  {
    "VDD3V3_USB",   VDD3V3_USB,  STPMIC_LDO4,   LDO4_MAIN_CR,    LDO4_MAIN_CR,    \
    LDO4_ALT_CR,    LDO4_ALT_CR,    LDO4_PWRCTRL_CR,   3300, 3300
  },
  {
    "VDD_FLASH",    VDD_FLASH,    STPMIC_LDO5,   LDO5_MAIN_CR,    LDO5_MAIN_CR,    \
    LDO5_ALT_CR,    LDO5_ALT_CR,    LDO5_PWRCTRL_CR,   3300, 3300
  },
  {
    "VDDA_1V8",     VDDA_1V8,    STPMIC_LDO6,   LDO6_MAIN_CR,    LDO6_MAIN_CR,    \
    LDO6_ALT_CR,    LDO6_ALT_CR,    LDO6_PWRCTRL_CR,   3300, 3300
  },
  {
    "LDO7_FREE",    LDO7_FREE,    STPMIC_LDO7,   LDO7_MAIN_CR,    LDO7_MAIN_CR,    \
    LDO7_ALT_CR,    LDO7_ALT_CR,    LDO7_PWRCTRL_CR,   0, 0
  },
  {
    "GPO1_3V3",    GPO1_3V3,    STPMIC_GPO1,   GPO1_MAIN_CR,    GPO1_MAIN_CR,    \
    GPO1_ALT_CR,    GPO1_ALT_CR,    GPO2_PWRCTRL_CR,   0, 0
  },
  {
    "GPO2_FREE",    GPO2_FREE,    STPMIC_GPO2,   GPO2_MAIN_CR,    GPO2_MAIN_CR,    \
    GPO2_ALT_CR,    GPO2_ALT_CR,    GPO2_PWRCTRL_CR,   0, 0
  },
{
    "GPO3_LED5",    GPO3_LED5,    STPMIC_GPO3,   GPO3_MAIN_CR,    GPO3_MAIN_CR,    \
    GPO3_ALT_CR,    GPO3_ALT_CR,    GPO3_PWRCTRL_CR,   0, 0
  },
{
    "GPO4_FREE",    GPO4_FREE,    STPMIC_GPO4,   GPO4_MAIN_CR,    GPO4_MAIN_CR,    \
    GPO4_ALT_CR,    GPO4_ALT_CR,    GPO4_PWRCTRL_CR,   0, 0
  },
{
    "GPO5_3V3_BKP", GPO5_3V3_BKP,    STPMIC_GPO5,   GPO5_MAIN_CR,    GPO5_MAIN_CR,    \
    GPO5_ALT_CR,    GPO5_ALT_CR,    GPO5_PWRCTRL_CR,   0, 0
  },
};


/**
  * @}
 */

/** @defgroup STPMIC_Private_Functions Private Functionss
  * @{
  */

/* Private function prototypes -----------------------------------------------*/

STPMIC2L_Object_t   STPMIC2LObj = { 0 };
static int32_t STPMIC_Probe();
void STPMIC_Enable_Interrupt(PMIC_IRQn IRQn);
void STPMIC_Disable_Interrupt(PMIC_IRQn IRQn);
void STPMIC_INTn_Callback(PMIC_IRQn IRQn);

/* Private functions ---------------------------------------------------------*/


static int32_t STPMIC_Probe()
{
  int32_t ret = STPMIC2L_OK;
  STPMIC2L_IO_t       IOCtx;
  uint8_t                id;

  /* Only perform the init if the object already exist */
  if (!CompObj)
  {
    /* Configure the I2C driver */
    IOCtx.Address     = STPMIC_I2C_ADDRESS;
    IOCtx.Init        = BSP_I2C3_Init;
    IOCtx.DeInit      = BSP_I2C3_DeInit;
    IOCtx.ReadReg     = BSP_I2C3_ReadReg;
    IOCtx.WriteReg    = BSP_I2C3_WriteReg;
    IOCtx.GetTick     = BSP_GetTick;

    ret = STPMIC2L_RegisterBusIO(&STPMIC2LObj, &IOCtx);
    if (ret != STPMIC2L_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    ret = STPMIC2L_ReadID(&STPMIC2LObj, &id);
    if (ret != STPMIC2L_OK)
    {
      return BSP_ERROR_COMPONENT_FAILURE;
    }

    if ((id & 0xF0) != STPMIC2L_ID)
    {
      return BSP_ERROR_UNKNOWN_COMPONENT;
    }

    Stpmic2lDrv = (STPMIC2L_Drv_t *) &STPMIC2L_Driver;
    CompObj = &STPMIC2LObj;
  }

  ret = Stpmic2lDrv->Init(CompObj);
  if (ret != STPMIC2L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_Init(void)
{
  int32_t status = BSP_ERROR_NONE;

  status = STPMIC_Probe();
  if (status != BSP_ERROR_NONE)
  {
    return status;
  }

#ifdef USE_WAKEUP_PIN

#else
  GPIO_InitTypeDef  GPIO_InitStruct;

  /* INTn - Interrupt Line - Active Low (Falling Edge) */
  PMIC_INTN_CLK_ENABLE();

  GPIO_InitStruct.Pin       = PMIC_INTN_PIN;
  GPIO_InitStruct.Mode      = GPIO_MODE_IT_FALLING;
  GPIO_InitStruct.Pull      = GPIO_PULLUP; /* GPIO_NOPULL */
  GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_HIGH;
  GPIO_InitStruct.Alternate = 0 ;
  HAL_GPIO_Init(PMIC_INTN_PORT, &GPIO_InitStruct);

  /* Enable and set INTn EXTI Interrupt  */
#if defined (CORE_CM33) || defined (CORE_CM0PLUS)
  HAL_NVIC_SetPriority(PMIC_INTN_EXTI_IRQ, 0, 0);
  HAL_NVIC_EnableIRQ(PMIC_INTN_EXTI_IRQ);
#endif /* defined (CORE_CM33) || defined (CORE_CM0PLUS) */
#endif /* USE_WAKEUP_PIN */

  STPMIC_Enable_Interrupt(STPMIC2L_IT_PONKEY_F);
  STPMIC_Enable_Interrupt(STPMIC2L_IT_PONKEY_R);

