STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_stpmic2l.c
  return BSP_ERROR_NONE;
}

uint32_t BSP_PMIC_DeInit(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->DeInit(CompObj);
  if (status != STPMIC2L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return status;
}

uint32_t BSP_PMIC_ReadReg(uint8_t reg, uint8_t *pdata)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->ReadReg(CompObj, reg, pdata);
  if (status != STPMIC2L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

uint32_t BSP_PMIC_WriteReg(uint8_t reg, uint8_t data)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->WriteReg(CompObj, reg, data);
  if (status != STPMIC2L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

uint32_t BSP_PMIC_UpdateReg(uint8_t reg, uint8_t mask)
{
  int32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->UpdateReg(CompObj, reg, mask);
  if (status != STPMIC2L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }
  return status;
}

#if defined (STPMIC2L_DEBUG)
/*
 *
 * PMIC registers dump
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_DumpRegs(void)
{
  uint32_t  status = BSP_ERROR_NONE;

  status = Stpmic2lDrv->DumpRegs(CompObj);
  if (status != STPMIC2L_OK)
  {
    return BSP_ERROR_COMPONENT_FAILURE;
  }

  return status;
}
#endif /* defined (STPMIC2L_DEBUG) */

/*
 *
 * @brief BSP_PMIC_DDR_Power_Init initialize DDR power
 *
 * DDR power on sequence is:
 * enable VPP_DDR
 * wait 2ms
 * enable VREF_DDR, VTT_DDR, VPP_DDR
 *
 * @param  None
 * @retval status
 *
 */
/* following are configurations */
uint32_t BSP_PMIC_DDR_Power_Init()
{
  uint32_t  status = BSP_ERROR_NONE;

  /* VDD1_DDR ==> LDO3 ==> 1800mV */
  if (BSP_PMIC_WriteReg(board_regulators_table[VDD1_DDR].control_reg1, 0x9) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  /* VDD2_DDR ==> BUCK2 ==> 1100mV */
  if (BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].control_reg1, 0x3C) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }


  /* enable VDD1_DDR */
  if (BSP_PMIC_UpdateReg(board_regulators_table[VDD1_DDR].control_reg1, 0x1) != BSP_ERROR_NONE)
  {
    return BSP_ERROR_PMIC;
  }

  HAL_Delay(2);

  /* enable VDD2_DDR */
  if (BSP_PMIC_UpdateReg(board_regulators_table[VDD2_DDR].control_reg2, 0x1 != BSP_ERROR_NONE))
  {
    return BSP_ERROR_PMIC;
  }

  return status;
}

uint32_t BSP_PMIC_REGU_Set_On(board_regul_t regu)
{
  uint32_t  status = BSP_ERROR_NONE;

  switch (regu)
  {
    case VDDA1V8_AON:
    case VDDIO:
    case VDD1_DDR:
    case VDD3V3_USB:
    case VDD_FLASH:
    case VDDA_1V8:
    case LDO7_FREE:
    case GPO1_3V3:
    case GPO2_FREE:
    case GPO3_LED5:
    case GPO4_FREE:
    case GPO5_3V3_BKP:
      /* set enable bit */
      if (BSP_PMIC_UpdateReg(board_regulators_table[regu].control_reg1, MAIN_CR_EN) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_PMIC;
      }
      break;
    case VDDCORE:
    case VDD2_DDR:
    case VDDCPU:
      /* set enable bit */
      if (BSP_PMIC_UpdateReg(board_regulators_table[regu].control_reg2, MAIN_CR_EN) != BSP_ERROR_NONE)
      {
        return BSP_ERROR_PMIC;
      }
      break;
    default:
      status = BSP_ERROR_WRONG_PARAM ;
      break;
  }

  return status;
}

uint32_t BSP_PMIC_REGU_Set_Off(board_regul_t regu)
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t data;

  switch (regu)
  {
    case VDDA1V8_AON:
    case VDDIO:
    case VDD1_DDR:
    case VDD3V3_USB:
    case VDD_FLASH:
    case VDDA_1V8:
    case LDO7_FREE:
    case GPO1_3V3:
    case GPO2_FREE:
    case GPO3_LED5:
    case GPO4_FREE:
    case GPO5_3V3_BKP:
      /* disable ==> clear enable bit */
      if (BSP_PMIC_ReadReg(board_regulators_table[regu].control_reg1,
                           &data) != BSP_ERROR_NONE) /* read control reg to save data */
      {
        return BSP_ERROR_PMIC;
      }

      data &= ~MAIN_CR_EN; /* clear enable bit */
      if (BSP_PMIC_WriteReg(board_regulators_table[regu].control_reg1,
                            data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
      {
        return BSP_ERROR_PMIC;
      }
      break;

    case VDDCORE:
    case VDD2_DDR:
    case VDDCPU:
      /* disable ==> clear enable bit */
      if (BSP_PMIC_ReadReg(board_regulators_table[regu].control_reg2,
                           &data) != BSP_ERROR_NONE) /* read control reg to save data */
      {
        return BSP_ERROR_PMIC;
      }

      data &= ~MAIN_CR_EN; /* clear enable bit */
      if (BSP_PMIC_WriteReg(board_regulators_table[regu].control_reg2,
                            data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
      {
        return BSP_ERROR_PMIC;
      }
      break;
    default:
      status = BSP_ERROR_WRONG_PARAM ;
      break;
  }

  return status;
}

uint32_t BSP_PMIC_DDR_Power_Off()
{
  uint32_t  status = BSP_ERROR_NONE;
  uint8_t data;

  /* disable VDD1_DDR */
  if (BSP_PMIC_ReadReg(board_regulators_table[VDD1_DDR].control_reg1,
                       &data) != BSP_ERROR_NONE) /* read control reg to save data */
  {
    return BSP_ERROR_PMIC;
  }

  data &= ~MAIN_CR_EN; /* clear enable bit */
  if (BSP_PMIC_WriteReg(board_regulators_table[VDD1_DDR].control_reg1,
                        data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
  {
    return BSP_ERROR_PMIC;
  }

  HAL_Delay(2);

  /* disable VDD2_DDR */
  if (BSP_PMIC_ReadReg(board_regulators_table[VDD2_DDR].control_reg2,
                       &data) != BSP_ERROR_NONE) /* read control reg to save data */
  {
    return BSP_ERROR_PMIC;
  }

  data &= ~MAIN_CR_EN; /* clear enable bit */
  if (BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].control_reg2,
                        data) != BSP_ERROR_NONE) /* write control reg to clear enable bit */
  {
    return BSP_ERROR_PMIC;
  }


  return status;
}

/**
  * @brief  BSP_PMIC_Set_Power_Mode Set PMIC run/low power mode
  * @param  mode  mode to set
  * @retval status
  */

uint32_t BSP_PMIC_Power_Mode_Init()
{
  uint32_t  status = BSP_ERROR_NONE;

  /* Fail-safe overcurrent protection */
  status = BSP_PMIC_WriteReg(FS_OCP_CR1, FS_OCP_BUCK2 | FS_OCP_BUCK2 | FS_OCP_BUCK1);
  status = BSP_PMIC_WriteReg(FS_OCP_CR2, FS_OCP_LDO6 | FS_OCP_LDO3 | FS_OCP_LDO2 | FS_OCP_LDO1);


