STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_stpmic2l.c
  /* Mask reset LDO control register (LDOS_MRST_CR) for VDDA1V8_AON(LDO1) & VDDIO(LDO2) */
  status = BSP_PMIC_WriteReg(LDOS_MRST_CR, LDO1_MRST);
  status = BSP_PMIC_WriteReg(LDOS_MRST_CR, LDO2_MRST);

  /* VDDA1V8_AON: LDO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA1V8_AON].control_reg1, MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA1V8_AON].pwr_control_reg, 0x0);

  /* VDDIO: LDO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO].control_reg1, \
                             (0x18 << 1) | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO].pwr_control_reg, 0x0);

  /* VDD1_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.8, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD1_DDR].control_reg1, \
                             (0x9 << 1) | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD1_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=3.3, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1, MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].pwr_control_reg, 0x0);

  /* VDD_FLASH: LDO5, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=3.3, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_FLASH].control_reg1, \
                             (0x18 << 1) |  MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_FLASH].pwr_control_reg, \
                             PWRCTRL_CR_SEL3 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_RST);

  /* VDDA_1V8: LDO6, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.8, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA_1V8].control_reg1, \
                             (0x9 << 1) |  MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA_1V8].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);
  
  /* LDO7_FREE: LDO7, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=FF */
  status = BSP_PMIC_WriteReg(board_regulators_table[LDO7_FREE].control_reg1, 0x0);
  status = BSP_PMIC_WriteReg(board_regulators_table[LDO7_FREE].pwr_control_reg, 0x0);

  /* GPO1_3V3: GPO1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO1_3V3].control_reg1, MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO1_3V3].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* GPO2_FREE: GPO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO2_FREE].control_reg1, 0x0);
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO2_FREE].pwr_control_reg, 0x0);

  /* GPO3_LED5: GPO3, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO3_LED5].control_reg1, MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO3_LED5].pwr_control_reg, 0x0);

  /* GPO4_FREE: GPO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO4_FREE].control_reg1, 0x0);
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO4_FREE].pwr_control_reg, 0x0);

  /* GPO5_3V3_BKP: GPO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO5_3V3_BKP].control_reg1, MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[GPO5_3V3_BKP].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.82, State=ON_AUTO */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg1, 0x20); 
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* VDD2_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.1, State=ON_AUTO */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].control_reg1, 0x3C);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].pwr_control_reg, \
                             PWRCTRL_CR_SEL1 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

  /* VDDCPU: BUCK3, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=0.8, State=ON_AUTO */
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].control_reg1, 0x1E);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].control_reg2, \
                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);
  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].pwr_control_reg, \
                             PWRCTRL_CR_SEL2 | PWRCTRL_CR_DLY_H0 | PWRCTRL_CR_DLY_L0 | PWRCTRL_CR_EN);

