STMicroelectronics/STM32CubeMP2/Drivers/BSP/STM32MP215F-DK/stm32mp215f_disco_stpmic2l.c
  	  /* GPO3_LED5: GPO3, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
  	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO3_LED5].control_reg1, MAIN_CR_EN);

  	  /* GPO4_FREE: GPO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
  	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
  	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO4_FREE].control_reg1, 0x0);

  	  /* GPO5_3V3_BKP: GPO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
  	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO5_3V3_BKP].alt_control_reg1, 0x00);

  	  /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
  	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x0);
  	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, 0x0);

  	  /* VDD2_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=1.1, State=ON_AUTO */
  	  status = BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].alt_control_reg1, 0x3C);
  	  status = BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].alt_control_reg2, \
  	                             MAIN_CR_PREG_AUTO_MODE | MAIN_CR_EN);

  	  /* VDDCPU: BUCK3, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
  	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
  	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg1, 0x0);
  	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg2, 0x0);

     /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
     status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
     data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
     status = BSP_PMIC_WriteReg(MAIN_CR, data); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 0 */


      break;

    case STPMIC2L_STANDBY_DDR_OFF:

    	  /* VDDA1V8_AON: LDO1, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=NA, State=ON */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA1V8_AON].control_reg1, MAIN_CR_EN);

    	  /* VDDIO: LDO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=0, Msk_Rst=1, Source=NA, V=3.3, State=ON */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDIO].control_reg1, \
    	                             (0x18 << 1) | MAIN_CR_EN);

    	  /* VDD1_DDR: LDO3, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDD1_DDR].alt_control_reg1,0x0);

    	  /* VDD3V3_USB: LDO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDD3V3_USB].control_reg1, 0x0);

    	  /* VDD_FLASH: LDO5, PWRCTRL_SEL=3, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=1, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDD_FLASH].control_reg1, 0x0);

    	  /* VDDA_1V8: LDO6, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDA_1V8].alt_control_reg1, 0x0);

    	  /* LDO7_FREE: LDO7, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[LDO7_FREE].control_reg1, 0x0);

    	  /* GPO1_3V3: GPO1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO1_3V3].alt_control_reg1, 0x0);

    	  /* GPO2_FREE: GPO2, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO2_FREE].control_reg1, 0x0);

    	  /* GPO3_LED5: GPO3, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=ON */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO3_LED5].control_reg1, MAIN_CR_EN);

    	  /* GPO4_FREE: GPO4, PWRCTRL_SEL=0, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=0,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO4_FREE].control_reg1, 0x0);

    	  /* GPO5_3V3_BKP: GPO5, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[GPO5_3V3_BKP].alt_control_reg1, 0x00);

    	  /* VDDCORE: BUCK1, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg1, 0x0);
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCORE].alt_control_reg2, 0x0);

    	  /* VDD2_DDR: BUCK2, PWRCTRL_SEL=1, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].alt_control_reg1, 0x0);
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDD2_DDR].alt_control_reg2, 0x0);

    	  /* VDDCPU: BUCK3, PWRCTRL_SEL=2, PWRCTRL_DLY_H=0, PWRCTRL_DLY_L=0, PWRCTRL_EN=1,
    	  PWRCTRL_RST=0, Msk_Rst=0, Source=NA, V=NA, State=OFF */
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg1, 0x0);
    	  status = BSP_PMIC_WriteReg(board_regulators_table[VDDCPU].alt_control_reg2, 0x0);

     /* STANDBY_PWRCTRL_SEL[1:0] = 0 */
      status = BSP_PMIC_ReadReg(MAIN_CR, &data); /* read MAIN_CR to save data */
      data &= ~STANDBY_PWRCTRL_SEL_3; /* clear STANDBY_PWRCTRL_SEL bits */
      status = BSP_PMIC_WriteReg(MAIN_CR, data| \
                                 STANDBY_PWRCTRL_SEL_1); /* write MAIN_CR to set STANDBY_PWRCTRL_SEL[1:0] = 1 */

      break;

    default :
      status = BSP_ERROR_WRONG_PARAM;
  }

